# Pandas

Pandas is an open source data analysis library written in Python. It is particularly well-suited for working with tabular data, such as Excel spreadsheets or CSV files.

Pandas has two types of data structures : 
+ ***Series***
+ ***Dataframe***

**Series** - It is a one dimensional array with indexes, similar to a column in spreadsheet or SQL table.

**Dataframe** - It ia a 2-dimensional labeled data structure in pandas, similar to a spreadsheet or SQL table. You can think of a Dataframe as a collection of Series objects, where each series represents a column.

### Importing Pandas

In [5]:
import numpy as np
import pandas as pd

### Creating a Dataframe

In [7]:
dict1 = {
    "Name" : ['Krishna', 'Omi', 'Mukul', 'Aditi', 'Manish', 'Aditya'],
    "Marks" : [81, 99, 95, 85, 70, 80],
    "Age" : [24, 21, 24, 21, 23, 25],
    "City" : ['Patna', 'Siwan', 'Varanasi', 'Ranchi', 'Jamshedpur', 'Bhopal']
}

In [8]:
df = pd.DataFrame(dict1)

In [9]:
df

      Name  Marks  Age        City
0  Krishna     81   24       Patna
1      Omi     99   21       Siwan
2    Mukul     95   24    Varanasi
3    Aditi     85   21      Ranchi
4   Manish     70   23  Jamshedpur
5   Aditya     80   25      Bhopal

***type() : When we want to know what kind of data a Pandas object (like a Series or Dataframe) is holding, we can use the type() function.***

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df['Name']

0    Krishna
1        Omi
2      Mukul
3      Aditi
4     Manish
5     Aditya
Name: Name, dtype: object

In [13]:
type(df['Name'])

pandas.core.series.Series

### Save the Dataframe as a CSV file

***to_csv() : It is a method used to save a Dataframe as a CSV file.***

In [16]:
df.to_csv('friends.csv')

In [17]:
df.to_csv('friends_index_false.csv', index=False)

### Assigns a new index to the Dataframe

***Index : It is like a list of labels that helps you to find specific rows in a Dataframe.***

In [20]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [21]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F']

In [22]:
df

      Name  Marks  Age        City
A  Krishna     81   24       Patna
B      Omi     99   21       Siwan
C    Mukul     95   24    Varanasi
D    Aditi     85   21      Ranchi
E   Manish     70   23  Jamshedpur
F   Aditya     80   25      Bhopal

In [23]:
df.index

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

***column : A column is a single vertical series of data in a Dataframe.***

In [25]:
df.columns

Index(['Name', 'Marks', 'Age', 'City'], dtype='object')

***head() : It is used to display the first few rows of a Dataframe.***

In [27]:
df.head()

      Name  Marks  Age        City
A  Krishna     81   24       Patna
B      Omi     99   21       Siwan
C    Mukul     95   24    Varanasi
D    Aditi     85   21      Ranchi
E   Manish     70   23  Jamshedpur

In [28]:
df.head(2)

      Name  Marks  Age   City
A  Krishna     81   24  Patna
B      Omi     99   21  Siwan

***tail() : It is used to display the last few rows of a Dataframe.***

In [30]:
df.tail()

     Name  Marks  Age        City
B     Omi     99   21       Siwan
C   Mukul     95   24    Varanasi
D   Aditi     85   21      Ranchi
E  Manish     70   23  Jamshedpur
F  Aditya     80   25      Bhopal

In [31]:
df.tail(2)

     Name  Marks  Age        City
E  Manish     70   23  Jamshedpur
F  Aditya     80   25      Bhopal

***shape : This will return a tuple representing the number of rows and columns in a Dataframe.***

In [33]:
df.shape

(6, 4)

***describe() : It is a method used to generate summary statistics of a Dataframe. It provides a quick overview of data, including count, mean, standard deviation, minimun, 25th percentile, 50th percentile (median), and maximum values.***

In [35]:
df.describe()

           Marks       Age
count   6.000000   6.00000
mean   85.000000  23.00000
std    10.601887   1.67332
min    70.000000  21.00000
25%    80.250000  21.50000
50%    83.000000  23.50000
75%    92.500000  24.00000
max    99.000000  25.00000

***T : It is used to transpose a Dataframe.***

In [37]:
df.T

             A      B         C       D           E       F
Name   Krishna    Omi     Mukul   Aditi      Manish  Aditya
Marks       81     99        95      85          70      80
Age         24     21        24      21          23      25
City     Patna  Siwan  Varanasi  Ranchi  Jamshedpur  Bhopal

***dtypes : In Pandas, dtypes (short for data types) refers to the type of data stored in each column of a Dataframe.***

In [39]:
df.dtypes

Name     object
Marks     int64
Age       int64
City     object
dtype: object

***info() : It provides summary information about the Dataframe, including data types, non-null values, and memory usage.***

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, A to F
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Age     6 non-null      int64
 3   City    6 non-null      object
dtypes: int64(2), object(2)
memory usage: 412.0+ bytes

***value_counts() : It is a method used to count the occurance of unique values in a series or Dataframe column.***

In [43]:
df['Age'].value_counts()

Age
24    2
21    2
23    1
25    1
Name: count, dtype: int64

### Converting a Dataframe or Series to Numpy array.

***to_numpy() : It is a method used to convert a Dataframe or Series to a Numpy array.***

In [46]:
df.to_numpy()

array([['Krishna', 81, 24, 'Patna'],
       ['Omi', 99, 21, 'Siwan'],
       ['Mukul', 95, 24, 'Varanasi'],
       ['Aditi', 85, 21, 'Ranchi'],
       ['Manish', 70, 23, 'Jamshedpur'],
       ['Aditya', 80, 25, 'Bhopal']], dtype=object)

### Creating a shallow copy of Dataframe.

A shallow copy in Pandas creates a new Dataframe object that refrences the same underlying data as the original Dataframe. This means that any changes made to one Dataframe will also reflect in the other.

***It is like two people sharing the same book. If one person writes something in the book, the other person will also see the change.***

In [49]:
df2 = df

In [50]:
df2

      Name  Marks  Age        City
A  Krishna     81   24       Patna
B      Omi     99   21       Siwan
C    Mukul     95   24    Varanasi
D    Aditi     85   21      Ranchi
E   Manish     70   23  Jamshedpur
F   Aditya     80   25      Bhopal

In [51]:
df2['Marks']['A'] = 33

C:\Users\mysel\AppData\Local\Temp\ipykernel_13316\3035179626.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2['Marks']['A'] = 33
C:\Users\mysel\AppData\Local\Temp\ipykernel_13316\3035179626.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Marks']['A'] = 33

In [52]:
df

      Name  Marks  Age        City
A  Krishna     33   24       Patna
B      Omi     99   21       Siwan
C    Mukul     95   24    Varanasi
D    Aditi     85   21      Ranchi
E   Manish     70   23  Jamshedpur
F   Aditya     80   25      Bhopal

### Creating a deep copy of Dataframe.

A deep copy in Pandas creates a new Dataframe object with its own copy of the data. This means the changes made to one Dataframe will not affect the other.

***To create a deeep copy of a Dataframe in Pandas, we use the copy() method.***

In [55]:
df3 = df.copy()

In [56]:
df3['Marks']['A'] = 100

C:\Users\mysel\AppData\Local\Temp\ipykernel_13316\4066807169.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df3['Marks']['A'] = 100
C:\Users\mysel\AppData\Local\Temp\ipykernel_13316\4066807169.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Marks']['A'] = 100

In [57]:
df3

      Name  Marks  Age        City
A  Krishna    100   24       Patna
B      Omi     99   21       Siwan
C    Mukul     95   24    Varanasi
D    Aditi     85   21      Ranchi
E   Manish     70   23  Jamshedpur
F   Aditya     80   25      Bhopal

In [58]:
df

      Name  Marks  Age        City
A  Krishna     33   24       Patna
B      Omi     99   21       Siwan
C    Mukul     95   24    Varanasi
D    Aditi     85   21      Ranchi
E   Manish     70   23  Jamshedpur
F   Aditya     80   25      Bhopal

### LOC AND ILOC

***loc : It is used for label-based indexing and selection. It allows you to select data from a Dataframe using rows and column labels, providing flexibility and ease of use.***

In [61]:
df.loc[0,0] = 10

In [62]:
df

      Name  Marks   Age        City     0
A  Krishna   33.0  24.0       Patna   NaN
B      Omi   99.0  21.0       Siwan   NaN
C    Mukul   95.0  24.0    Varanasi   NaN
D    Aditi   85.0  21.0      Ranchi   NaN
E   Manish   70.0  23.0  Jamshedpur   NaN
F   Aditya   80.0  25.0      Bhopal   NaN
0      NaN    NaN   NaN         NaN  10.0

***drop() : It is used to remove rows or columns in a Dataframe.***

In [64]:
df = df.drop(0, axis=0)
df = df.drop(0, axis=1)

In [65]:
df

      Name  Marks   Age        City
A  Krishna   33.0  24.0       Patna
B      Omi   99.0  21.0       Siwan
C    Mukul   95.0  24.0    Varanasi
D    Aditi   85.0  21.0      Ranchi
E   Manish   70.0  23.0  Jamshedpur
F   Aditya   80.0  25.0      Bhopal

In [66]:
df.drop(['Marks', 'Age'], axis=1)

      Name        City
A  Krishna       Patna
B      Omi       Siwan
C    Mukul    Varanasi
D    Aditi      Ranchi
E   Manish  Jamshedpur
F   Aditya      Bhopal

In [67]:
df

      Name  Marks   Age        City
A  Krishna   33.0  24.0       Patna
B      Omi   99.0  21.0       Siwan
C    Mukul   95.0  24.0    Varanasi
D    Aditi   85.0  21.0      Ranchi
E   Manish   70.0  23.0  Jamshedpur
F   Aditya   80.0  25.0      Bhopal

In [68]:
df.loc[['A', 'B'],['Name','City']]

      Name   City
A  Krishna  Patna
B      Omi  Siwan

In [69]:
df.loc[:,['Name','City']]

      Name        City
A  Krishna       Patna
B      Omi       Siwan
C    Mukul    Varanasi
D    Aditi      Ranchi
E   Manish  Jamshedpur
F   Aditya      Bhopal

In [70]:
df.loc[['A', 'B'],:]

      Name  Marks   Age   City
A  Krishna   33.0  24.0  Patna
B      Omi   99.0  21.0  Siwan

In [71]:
df.loc[(df['Marks']>80)]

    Name  Marks   Age      City
B    Omi   99.0  21.0     Siwan
C  Mukul   95.0  24.0  Varanasi
D  Aditi   85.0  21.0    Ranchi

In [72]:
df.loc[(df['Marks']>80) & (df['Age']<24)]

    Name  Marks   Age    City
B    Omi   99.0  21.0   Siwan
D  Aditi   85.0  21.0  Ranchi

***iloc : It is another powerful tool in Pandas for integer-based indexing. It allows you to select data from a Dataframe using row and column indices, providing a more direct way to access data based on its position.***

In [74]:
df

      Name  Marks   Age        City
A  Krishna   33.0  24.0       Patna
B      Omi   99.0  21.0       Siwan
C    Mukul   95.0  24.0    Varanasi
D    Aditi   85.0  21.0      Ranchi
E   Manish   70.0  23.0  Jamshedpur
F   Aditya   80.0  25.0      Bhopal

In [75]:
df.iloc[0,0]

'Krishna'

In [76]:
df.iloc[0,1] = 90

In [77]:
df

      Name  Marks   Age        City
A  Krishna   90.0  24.0       Patna
B      Omi   99.0  21.0       Siwan
C    Mukul   95.0  24.0    Varanasi
D    Aditi   85.0  21.0      Ranchi
E   Manish   70.0  23.0  Jamshedpur
F   Aditya   80.0  25.0      Bhopal

In [78]:
df.iloc[[0,1],[0,3]]

      Name   City
A  Krishna  Patna
B      Omi  Siwan

### Resetting the Indices

***reset_index() : It is a function used to reset the index of a Dataframe, replacing the existing index with a default index starting from 0.***

***inplace=True : It directly alter the existing Dataframe object rather than creating a new one.***

In [82]:
df.reset_index(drop=True, inplace=True)

In [83]:
df

      Name  Marks   Age        City
0  Krishna   90.0  24.0       Patna
1      Omi   99.0  21.0       Siwan
2    Mukul   95.0  24.0    Varanasi
3    Aditi   85.0  21.0      Ranchi
4   Manish   70.0  23.0  Jamshedpur
5   Aditya   80.0  25.0      Bhopal

### Read CSV file

***read_csv() : It is a powerful function used to read CSV files into a Pandas Dataframe.***

In [86]:
salary = pd.read_csv('salary.csv')

In [87]:
salary

  First Name Last Name               Department  Salary      City
0      Aditi    Prasad             Data Science   60000    Ranchi
1     Mukul     Mishra       Software Developer   80000     Siwan
2    Dheeraj    Sharma           Java Developer   50000   Guwhati
3     Jatin   Prashant         Machine Learning   85000  Banglore
4      Mahak     Gupta           Java Developer   40000  Banglore
5        Omi     Singh  Artificial Intelligence  100000     Siwan

In [88]:
salary['City'][1]

'Siwan'

In [89]:
salary['City'][1] = 'Varanasi'

C:\Users\mysel\AppData\Local\Temp\ipykernel_13316\3037455126.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  salary['City'][1] = 'Varanasi'
C:\Users\mysel\AppData\Local\Temp\ipykernel_13316\3037455126.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  salary['City'][1] = 'Varanasi'

In [90]:
salary

  First Name Last Name               Department  Salary      City
0      Aditi    Prasad             Data Science   60000    Ranchi
1     Mukul     Mishra       Software Developer   80000  Varanasi
2    Dheeraj    Sharma           Java Developer   50000   Guwhati
3     Jatin   Prashant         Machine Learning   85000  Banglore
4      Mahak     Gupta           Java Developer   40000  Banglore
5        Omi     Singh  Artificial Intelligence  100000     Siwan

***sort_index() : It is a function used to sort the rows of a Dataframe or Series based on thier index labels.***

In [92]:
salary.sort_index(axis=0, ascending=False)

  First Name Last Name               Department  Salary      City
5        Omi     Singh  Artificial Intelligence  100000     Siwan
4      Mahak     Gupta           Java Developer   40000  Banglore
3     Jatin   Prashant         Machine Learning   85000  Banglore
2    Dheeraj    Sharma           Java Developer   50000   Guwhati
1     Mukul     Mishra       Software Developer   80000  Varanasi
0      Aditi    Prasad             Data Science   60000    Ranchi

In [93]:
salary.sort_index(axis=1, ascending=False)

   Salary Last Name First Name               Department      City
0   60000    Prasad      Aditi             Data Science    Ranchi
1   80000    Mishra     Mukul        Software Developer  Varanasi
2   50000    Sharma    Dheeraj           Java Developer   Guwhati
3   85000  Prashant     Jatin          Machine Learning  Banglore
4   40000     Gupta      Mahak           Java Developer  Banglore
5  100000     Singh        Omi  Artificial Intelligence     Siwan

### Creating a Series

In [95]:
ser = pd.Series(np.random.rand(10))

In [96]:
ser

0    0.641984
1    0.773593
2    0.174946
3    0.172561
4    0.157367
5    0.310943
6    0.378972
7    0.891336
8    0.808192
9    0.546590
dtype: float64

In [97]:
type(ser)

pandas.core.series.Series

### Creating another Dataframe.

In [99]:
dict2 = {
    "id" : [101, 102, 103, 104],
    "name" : ['Bob', 'Max', 'Max', 'Smith'],
    "branch" : ['CSE', 'IT', 'CSE', 'IT'],
    "CGPA" : [8.15, 8.8, 7.2, 9.0],
    "age" : [np.nan, 23, 24, np.nan],
    "blood_group" : ['AB+', np.nan, 'O+', 'O-']
}

In [100]:
newdf = pd.DataFrame(dict2)

In [101]:
newdf

    id   name branch  CGPA   age blood_group
0  101    Bob    CSE  8.15   NaN         AB+
1  102    Max     IT  8.80  23.0         NaN
2  103    Max    CSE  7.20  24.0          O+
3  104  Smith     IT  9.00   NaN          O-

***notnull() : It is a method used to check for missing values in a Series or Dataframe. It returns a Boolean Series or Dataframe where True indicates that the value is not null and False indicates that the value is null.***

In [103]:
newdf.notnull()

     id  name  branch  CGPA    age  blood_group
0  True  True    True  True  False         True
1  True  True    True  True   True        False
2  True  True    True  True   True         True
3  True  True    True  True  False         True

***None : It is a special value used to represent missing data or null values.***

In [105]:
newdf['blood_group'] = None

In [106]:
newdf

    id   name branch  CGPA   age blood_group
0  101    Bob    CSE  8.15   NaN        None
1  102    Max     IT  8.80  23.0        None
2  103    Max    CSE  7.20  24.0        None
3  104  Smith     IT  9.00   NaN        None

***is_null() or is_na() : is_null() or is_na() are two equivalent methods in Pandas used to check for missing values in a Dataframe. It returns a Boolean mask indicating which values are null (True) or not null (False).***

In [108]:
newdf.isnull()

      id   name  branch   CGPA    age  blood_group
0  False  False   False  False   True         True
1  False  False   False  False  False         True
2  False  False   False  False  False         True
3  False  False   False  False   True         True

In [109]:
newdf

    id   name branch  CGPA   age blood_group
0  101    Bob    CSE  8.15   NaN        None
1  102    Max     IT  8.80  23.0        None
2  103    Max    CSE  7.20  24.0        None
3  104  Smith     IT  9.00   NaN        None

***dropna() : It is a function in Pandas used to remove rows or columns containing missing values.***

+ **Dropping rows with missing values :** df.dropna()
+ **Dropping columns with missing values :** df.dropna(axis=1)

In [111]:
newdf.dropna(how='all', axis=1, inplace=True)

In [112]:
newdf

    id   name branch  CGPA   age
0  101    Bob    CSE  8.15   NaN
1  102    Max     IT  8.80  23.0
2  103    Max    CSE  7.20  24.0
3  104  Smith     IT  9.00   NaN

In [113]:
newdf.dropna()

    id name branch  CGPA   age
1  102  Max     IT   8.8  23.0
2  103  Max    CSE   7.2  24.0

***drop_duplicates() : It is a function used to remove duplicate rows from a Dataframe. It uses the subset argument to specify which columns for consider***

In [115]:
newdf

    id   name branch  CGPA   age
0  101    Bob    CSE  8.15   NaN
1  102    Max     IT  8.80  23.0
2  103    Max    CSE  7.20  24.0
3  104  Smith     IT  9.00   NaN

In [116]:
newdf.drop_duplicates(subset=['name'])

    id   name branch  CGPA   age
0  101    Bob    CSE  8.15   NaN
1  102    Max     IT  8.80  23.0
3  104  Smith     IT  9.00   NaN

In [117]:
newdf.drop_duplicates(subset=['name'], keep='first')

    id   name branch  CGPA   age
0  101    Bob    CSE  8.15   NaN
1  102    Max     IT  8.80  23.0
3  104  Smith     IT  9.00   NaN

In [118]:
newdf.drop_duplicates(subset=['name'], keep='last')

    id   name branch  CGPA   age
0  101    Bob    CSE  8.15   NaN
2  103    Max    CSE  7.20  24.0
3  104  Smith     IT  9.00   NaN

In [119]:
newdf.drop_duplicates(subset=['name'], keep=False)

    id   name branch  CGPA  age
0  101    Bob    CSE  8.15  NaN
3  104  Smith     IT  9.00  NaN

### Read Excel file

***read_excel() : It is a function used to read data from an Excel file into a Dataframe.***

In [122]:
company = pd.read_excel('company.xlsx', sheet_name='Sheet1')

In [123]:
company

  Enrollment_no     Name    Company
0  0105IT201059   Khushi     Google
1  0105IT201060  Krishna     PayPal
2  0105IT201061    Mahak  Microsoft
3  0105IT201062   Manish       Zoho

In [124]:
company = pd.read_excel('company.xlsx', sheet_name='Sheet2')

In [125]:
company

  Enrollment_no     Name  Salary
0  0105IT201059   Khushi  200000
1  0105IT201060  Krishna  150000
2  0105IT201061    Mahak  180000
3  0105IT201062   Manish  300000